tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "sdkman/tap"

brew "mas"
brew "git"
brew "git-secrets"
brew "wget"
brew "curl"
brew "jq"
brew "gettext"
brew "ghq"
brew "neovim"
brew "nushell"
brew "zsh"
brew "starship"
brew "rust"
brew "go"
brew "frum"
brew "sdkman-cli"
brew "awscli"
brew "kubernetes-cli"
brew "terraform"
brew "fnm"
brew "cocoapods"
brew "kdoctor"

cask "wireshark"
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "google-chrome"
cask "slack"
cask "openvpn-connect"
cask "sourcetree"
cask "rancher"
cask "postman"
cask "kap"
cask "iterm2"
cask "obsidian"

mas "Xcode", id: 497799835
mas "Boop", id: 1518425043
